app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    @events = Event.search(params[:term])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @event = Event.find(params[:id])

INSERT INTO "events" ("user_id", "event_date", "event_time", "event_name", "address", "city", "state", "zip", "description") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @events = Event.search(params[:term])
    @event = Event.new(event_params)
    @event.user = current_user

    if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def edit
    @event = Event.find(params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "events" SET "description" = $1 WHERE "events"."id" = $2  [["description", "edit"], ["id", 2]]
---
  def update
    @event = Event.find(params[:id])
    @event.assign_attributes(event_params)

    if @event.valid?
      @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]
---
  def destroy
    @event = Event.find(params[:id])
    @Event.delete